In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as pyplot

In [2]:
database_name = 'scooters'    # Fill this in with your lahman database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)


- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

#null values

query= '''
select count(*)
from scooters
where * is null'''

with engine.connect() as connection:
    nulls = connection.execute(text(query))

select count(sumdid), companyname
from scooters
where sumdgroup like 'bicycle'
group by companyname

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [6]:
query1='''
select distinct sumdid,companyname
from scooters
group by sumdid, companyname;
'''

with engine.connect() as connection:
    companies = pd.read_sql(text(query1), con = connection)

companies.head()

                                         sumdid companyname
0  Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619        Bolt
1  Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d        Bolt
2  Powered-03be23ca-d43b-222f-be54-e44b5b4690df        Bolt
3  Powered-046201fb-6532-1f37-6334-3612fb1e61f7        Bolt
4  Powered-0479bb84-afbd-0426-f1c4-df628542a88c        Bolt

In [12]:
total_scoots=companies.groupby(['companyname']).count()
total_scoots=total_scoots.sort_values(by='sumdid',ascending=False)
total_scoots.head(7)

             sumdid
companyname
Bird           3860
Lime           1824
Lyft           1735
Jump           1210
Spin            805
Bolt            360
Gotcha          224

In [ ]:
query2='''
select distinct sumdid,companyname,min(pubdatetime) as date
from scooters
where pubdatetime'''

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule?

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

4. What is the highest count of scooters being used at the same time? When did it occur? Does this vary by zip code or other geographic region?

5. SUMDs can provide alternative transportation and provide "last mile" access to public transit. How often are trips starting near public transit hubs? You can download a dataset of bus stop locations from https://data.nashville.gov/Transportation/Regional-Transportation-Authority-Bus-Stops/p886-fnbd